print("สร้างตัวละครของคุณ")
print("ตัวละครของคุณชื่ออะไร?")
print()
name = input("ชื่อ: ")
print()
print("สวัสดีคุณ",name,"ตัวละครของคุณสูงและหนักเท่าไหร่?")
print()
cm = int(input("สูง: "))
kg = int(input("หนัก: "))

if cm < 0:
    print("เอาจริงดิ?")
elif cm < 140:
    print("ยังไม่สูง")
elif cm < 155:
    print("ส่วนสูงน่ารักดี555")
elif cm < 170:
    print("กําลังดีแต่ไม่สุดมาก")
elif cm < 180:
    print("สูงแบบพอดีไม่มากไปและน้อยไป")
elif cm < 190:
    print("เชรดเข้! กําลังดีเลย")
else:
    print("คนหรือเสาไฟฟ้า")

print()
print("ความสามารถพิเศษของคุณคืออะไร")
ab = input("ความสามารถพิเศษคือ: ")
print()
print("คุณถนัดด้านอะไรมากสุด?")
sd = input("ถนัดด้าน: ")
print()
print("นี่คือตัวละครของคุณ!")
print()
print("ชื่อ",name,"สูง",cm,"หนัก",kg,"พลังวิเศษของคุณคือ",ab,"คุณถนัดด้าน",sd)
